In [42]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

In [43]:
dataset = pd.read_csv("loan_approval_dataset.csv")
dataset.head()

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value,loan_status
0,1,2,Graduate,No,9600000,29900000,12,778,2400000,17600000,22700000,8000000,Approved
1,2,0,Not Graduate,Yes,4100000,12200000,8,417,2700000,2200000,8800000,3300000,Rejected
2,3,3,Graduate,No,9100000,29700000,20,506,7100000,4500000,33300000,12800000,Rejected
3,4,3,Graduate,No,8200000,30700000,8,467,18200000,3300000,23300000,7900000,Rejected
4,5,5,Not Graduate,Yes,9800000,24200000,20,382,12400000,8200000,29400000,5000000,Rejected

In [44]:
dataset.shape

(4269, 13)

In [45]:
dataset.nunique()

loan_id                      4269
 no_of_dependents               6
 education                      2
 self_employed                  2
 income_annum                  98
 loan_amount                  378
 loan_term                     10
 cibil_score                  601
 residential_assets_value     278
 commercial_assets_value      188
 luxury_assets_value          379
 bank_asset_value             146
 loan_status                    2
dtype: int64

In [46]:
dataset.duplicated().sum()

0

In [47]:
dataset.columns

Index(['loan_id', ' no_of_dependents', ' education', ' self_employed',
       ' income_annum', ' loan_amount', ' loan_term', ' cibil_score',
       ' residential_assets_value', ' commercial_assets_value',
       ' luxury_assets_value', ' bank_asset_value', ' loan_status'],
      dtype='object')

In [48]:
dataset.columns = [i.strip() for i in dataset.columns]
dataset.columns

Index(['loan_id', 'no_of_dependents', 'education', 'self_employed',
       'income_annum', 'loan_amount', 'loan_term', 'cibil_score',
       'residential_assets_value', 'commercial_assets_value',
       'luxury_assets_value', 'bank_asset_value', 'loan_status'],
      dtype='object')

In [49]:
X = dataset.drop(['loan_status'],axis=1)
y = dataset['loan_status']

In [50]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4269 entries, 0 to 4268
Data columns (total 12 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   loan_id                   4269 non-null   int64
 1   no_of_dependents          4269 non-null   int64
 2   education                 4269 non-null   object
 3   self_employed             4269 non-null   object
 4   income_annum              4269 non-null   int64
 5   loan_amount               4269 non-null   int64
 6   loan_term                 4269 non-null   int64
 7   cibil_score               4269 non-null   int64
 8   residential_assets_value  4269 non-null   int64
 9   commercial_assets_value   4269 non-null   int64
 10  luxury_assets_value       4269 non-null   int64
 11  bank_asset_value          4269 non-null   int64
dtypes: int64(10), object(2)
memory usage: 400.3+ KB

In [51]:
asset_cols = ['residential_assets_value','commercial_assets_value','luxury_assets_value','bank_asset_value']
X['total_asset_value'] = X[asset_cols].sum(axis=1)
X.drop(asset_cols,axis=1,inplace=True)
X.head()

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,total_asset_value
0,1,2,Graduate,No,9600000,29900000,12,778,50700000
1,2,0,Not Graduate,Yes,4100000,12200000,8,417,17000000
2,3,3,Graduate,No,9100000,29700000,20,506,57700000
3,4,3,Graduate,No,8200000,30700000,8,467,52700000
4,5,5,Not Graduate,Yes,9800000,24200000,20,382,55000000

In [52]:
X['education'].unique()

array([' Graduate', ' Not Graduate'], dtype=object)

In [53]:
X['self_employed'].unique()

array([' No', ' Yes'], dtype=object)

In [54]:
y.unique()

array([' Approved', ' Rejected'], dtype=object)

In [55]:
X['education'] = X['education'].str.strip()
X['self_employed'] = X['self_employed'].str.strip()
y = y.str.strip()

In [56]:
label_encoder = LabelEncoder()

In [57]:
X['education'] = label_encoder.fit_transform(X['education'])
X['self_employed'] = label_encoder.fit_transform(X['self_employed'])
y = y.map({"Approved":1,"Rejected":0})

In [58]:
log_cols = ['income_annum','loan_amount','total_asset_value']
X[log_cols] = np.log(X[log_cols])

In [59]:
X.head()

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,total_asset_value
0,1,2,0,0,16.077274,17.213369,12,778,17.741436
1,2,0,1,1,15.226498,16.316947,8,417,16.648724
2,3,3,0,0,16.023785,17.206658,20,506,17.870768
3,4,3,0,0,15.919645,17.239773,8,467,17.780126
4,5,5,1,1,16.097893,17.001863,20,382,17.822844

In [60]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3,random_state=0)

In [64]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()
lr.fit(X_train,y_train)

y_pred = lr.predict(X_test)

c:\Users\Prashanth\miniconda3\envs\cobra\Lib\site-packages\sklearn\linear_model\_logistic.py:469: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

In [68]:
from sklearn.metrics import accuracy_score,roc_auc_score
acc = round(accuracy_score(y_test,y_pred),3)
roc_auc = round(roc_auc_score(y_test,y_pred),3)

print(f"Accuracy : {acc}\nROC_AUC : {roc_auc}")

Accuracy : 0.912
ROC_AUC : 0.905